Description: Creates all production policies for a particular title.
Comment: For standard recipes, Identifier, CATEGORY, NAME, SELF_SERVICE_DESCRIPTION need to be provided.
Identifier: com.github.eth-its-recipes.jamf.template-prod
MinimumVersion: 2.0.0

Input:
  NAME: INSERT_SOFTWARE_NAME_HERE
  SELFSERVICE_POLICY_CATEGORY: INSERT_PROD_CATEGORY_HERE
  SELFSERVICE_DESCRIPTION: "-----CHANGE THE DESCRIPTION------"
  JSS_INVENTORY_NAME: "%NAME%.app"
  AUTOINSTALL_GROUP_NAME: "%NAME% auto-install"
  AUTOINSTALL_GROUP_TEMPLATE: SmartGroup-autoinstall.xml
  AUTOUPDATE_GROUP_NAME: "%NAME% auto-update"
  AUTOUPDATE_GROUP_TEMPLATE: SmartGroup-autoupdate.xml
  PROD_INSTALLED_GROUP_NAME: "%NAME% current version installed"
  PROD_INSTALLED_GROUP_TEMPLATE: SmartGroup-prod-version-installed.xml
  UNTESTED_INSTALLED_GROUP_NAME: "%NAME% test version installed"
  UNTESTED_INSTALLED_GROUP_TEMPLATE: SmartGroupTemplate-test-version-installed.xml
  INSTALLED_GROUP_NAME: "%NAME% installed"
  INSTALLED_GROUP_TEMPLATE: SmartGroup-installed.xml
  USERS_GROUP_NAME: "%NAME% users"
  USERS_GROUP_TEMPLATE: SmartGroupTemplate-users.xml
  TRIGGER_POLICY_CATEGORY: Triggered Installers
  UPDATE_POLICY_CATEGORY: Updates
  AUTOUPDATE_POLICY_CATEGORY: Auto-updaters
  AUTOINSTALL_POLICY_CATEGORY: Auto-installers
  TRIGGER_POLICY_NAME: "Install %NAME%"
  TRIGGER_POLICY_TEMPLATE: PolicyTemplate-prod-triggeronly.xml
  UPDATE_POLICY_NAME: "Update %NAME%"
  UPDATE_POLICY_TEMPLATE: Policy-prod-selfservice-update.xml
  SELFSERVICE_POLICY_NAME: "%NAME%"
  SELFSERVICE_POLICY_TEMPLATE: Policy-prod-selfservice-install.xml
  AUTOINSTALL_POLICY_NAME: "Auto-install %NAME%"
  AUTOINSTALL_POLICY_TEMPLATE: Policy-prod-autoinstall.xml
  AUTOUPDATE_POLICY_NAME: "Auto-update %NAME%"
  AUTOUPDATE_POLICY_TEMPLATE: PolicyTemplate-prod-autoupdate.xml
  AUTOINSTALL_ALL_SOFTWARE_GROUP_NAME: Software Gets Auto-installed
  AUTOINSTALL_ALL_SOFTWARE_GROUP_TEMPLATE: SmartGroupTemplate-install-all.xml
  AUTOUPDATE_ALL_SOFTWARE_GROUP_NAME: Software Gets Auto-updated
  AUTOUPDATE_ALL_SOFTWARE_GROUP_TEMPLATE: SmartGroupTemplate-update-all.xml
  TRIGGER_NAME: "%NAME%-install"
  SELFSERVICE_DISPLAY_NAME: "%NAME%"
  SELFSERVICE_INSTALL_BUTTON: Install
  SELFSERVICE_REINSTALL_BUTTON: Install
  SELFSERVICE_ICON: "%NAME%.png"
  UPDATE_SELFSERVICE_DISPLAY_NAME: "Update %NAME%"
  UPDATE_SELFSERVICE_DESCRIPTION: "The application will be upgraded to version %version%."
  UPDATE_SELFSERVICE_INSTALL_BUTTON: Update
  UPDATE_SELF_ERVICE_REINSTALL_BUTTON: Update
  PROD_PREDICATE: "ready_to_stage == False"

Process:
  - Processor: com.github.eth-its-recipes.commonprocessors/JamfRecipeReceiptChecker
    Arguments:
      name: "%NAME%"

  - Processor: ch.ethz.id.commonprocessors/CheckSharepointToStage

  - Processor: StopProcessingIf
    Arguments:
      predicate: "%PROD_PREDICATE%"

++++++++

  - Processor: ch.ethz.id.postprocessors/Policytool
