Description: Uploads the pkg to the JSS, and creates a Self-Service Policy available to members of a Testing group.
Identifier: com.github.eth-its-recipes.jamf.ETHPrinters-prod
MinimumVersion: 2.0.0
ParentRecipe: com.github.eth-its-recipes.jamf.template-prod

Input:
  NAME: ETH Printers
  UNTESTED_RECIPE_IDENTIFIER: local.jamf.ETHPrinters
  SCRIPT_NAME: ETHPrinters-preinstall.sh
  SCRIPT_PRIORITY: Before
  TRIGGER_POLICY_TEMPLATE: Policy-script-triggeronly.xml
