Description: Uploads the pkg to the JSS, and creates a Self-Service Policy available to members of a Testing group.
Identifier: com.github.eth-its-recipes.jamf.GoogleChrome-prod
MinimumVersion: 2.0.0
ParentRecipe: com.github.eth-its-recipes.jamf.template-noupdate-prod

Input:
  NAME: Google Chrome
  UNTESTED_RECIPE_IDENTIFIER: local.jamf.GoogleChrome
