Description: Creates all production policies for a particular title.
Identifier: com.github.eth-its-recipes.jamf.macos-catalina-upgrade-prod
MinimumVersion: 2.0.0
ParentRecipe: com.github.eth-its-recipes.jamf.template-macos-prod

Input:
  NAME: Upgrade to macOS Catalina
  UNTESTED_RECIPE_IDENTIFIER: local.jamf.macos-catalina-upgrade
  INSTALLED_GROUP_TEMPLATE: SmartGroup-macOS-upgrade-ineligible.xml
  MIN_OS_VERSION: "10.12.4"
  MAX_OS_VERSION: "10.14.7"
  MODEL_IDENTIFIER_REGEX: ^(iMac1[3-9]|iMac2[0-9]|iMacPro|MacBook[8-9]|MacBook1[0-9]|MacBookAir[5-9]|MacBookAir1[0-9]|MacBookPro9|MacBookPro1[0-6]|MacMini[6-9]|MacPro[5-9])
  TRIGGER_POLICY_RUN_COMMAND: /Library/Management/erase-install/erase-install.sh --os=10.15 --update --reinstall
  INSTALL_BUTTON_TEXT: Upgrade macOS
  REINSTALL_BUTTON_TEXT: Upgrade macOS
