<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Comment</key>
	<string>This is a template recipe and cannot be used without a child recipe or RecipeOverride.
UNTESTED_RECIPE_IDENTIFIER must be supplied
NAME, SELFSERVICE_DESCRIPTION and SELFSERVICE_POLICY_CATEGORY need to be provided in the child recipe. 
If the app name does not match NAME.app, JSS_INVENTORY_NAME should also be overridden.
If the icon does not match NAME.png, SELFSERVICE_ICON should also be overridden.
 may require additional information.
</string>
	<key>Description</key>
	<string>Creates all production policies for a particular title.</string>
	<key>Identifier</key>
	<string>com.github.eth-its-recipes.jamf.template-prod</string>
	<key>Input</key>
	<dict>
		<key>AUTOINSTALL_ALL_SOFTWARE_GROUP_NAME</key>
		<string>Software Gets Auto-installed</string>
		<key>AUTOINSTALL_ALL_SOFTWARE_GROUP_TEMPLATE</key>
		<string>SmartGroup-autoinstall-all-software.xml</string>
		<key>AUTOINSTALL_GROUP_NAME</key>
		<string>%NAME% auto-install</string>
		<key>AUTOINSTALL_GROUP_TEMPLATE</key>
		<string>SmartGroup-autoinstall.xml</string>
		<key>AUTOINSTALL_POLICY_CATEGORY</key>
		<string>Auto-installers</string>
		<key>AUTOINSTALL_POLICY_FREQUENCY</key>
		<string>Once every day</string>
		<key>AUTOINSTALL_POLICY_NAME</key>
		<string>Auto-install %NAME%</string>
		<key>AUTOINSTALL_POLICY_TEMPLATE</key>
		<string>Policy-prod-autoinstall.xml</string>
		<key>AUTOUPDATE_ALL_SOFTWARE_GROUP_NAME</key>
		<string>Software Gets Auto-updated</string>
		<key>AUTOUPDATE_ALL_SOFTWARE_GROUP_TEMPLATE</key>
		<string>SmartGroup-autoupdate-all-software.xml</string>
		<key>AUTOUPDATE_GROUP_NAME</key>
		<string>%NAME% auto-update</string>
		<key>AUTOUPDATE_GROUP_TEMPLATE</key>
		<string>SmartGroup-autoupdate.xml</string>
		<key>AUTOUPDATE_POLICY_CATEGORY</key>
		<string>Auto-updaters</string>
		<key>AUTOUPDATE_POLICY_FREQUENCY</key>
		<string>Once every day</string>
		<key>AUTOUPDATE_POLICY_NAME</key>
		<string>Auto-update %NAME%</string>
		<key>AUTOUPDATE_POLICY_TEMPLATE</key>
		<string>Policy-prod-autoupdate.xml</string>
		<key>INSTALLED_GROUP_NAME</key>
		<string>%NAME% installed</string>
		<key>INSTALLED_GROUP_TEMPLATE</key>
		<string>SmartGroup-installed.xml</string>
		<key>JSS_INVENTORY_NAME</key>
		<string>%NAME%.app</string>
		<key>PROD_PREDICATE</key>
		<string>ready_to_stage == False</string>
		<key>PROD_VERSION_INSTALLED_GROUP_NAME</key>
		<string>%NAME% current version installed</string>
		<key>PROD_VERSION_INSTALLED_GROUP_TEMPLATE</key>
		<string>SmartGroup-prod-version-installed.xml</string>
		<key>SELFSERVICE_DISPLAY_NAME</key>
		<string>%NAME%</string>
		<key>SELFSERVICE_ICON</key>
		<string>%NAME%.png</string>
		<key>SELFSERVICE_POLICY_NAME</key>
		<string>%NAME%</string>
		<key>SELFSERVICE_POLICY_TEMPLATE</key>
		<string>Policy-prod-selfservice-install.xml</string>
		<key>TEST_USERS_GROUP_NAME</key>
		<string>%NAME% test users</string>
		<key>TRIGGER_NAME</key>
		<string>%NAME%-install</string>
		<key>TRIGGER_POLICY_CATEGORY</key>
		<string>Triggered Installers</string>
		<key>TRIGGER_POLICY_NAME</key>
		<string>Install %NAME%</string>
		<key>TRIGGER_POLICY_RUN_COMMAND</key>
		<string></string>
		<key>TRIGGER_POLICY_TEMPLATE</key>
		<string>Policy-prod-triggeronly.xml</string>
		<key>UNTESTED_VERSION_INSTALLED_GROUP_NAME</key>
		<string>%NAME% test version installed</string>
		<key>UPDATE_POLICY_CATEGORY</key>
		<string>Updates</string>
		<key>UPDATE_POLICY_NAME</key>
		<string>Update %NAME%</string>
		<key>UPDATE_POLICY_TEMPLATE</key>
		<string>Policy-prod-selfservice-update.xml</string>
		<key>UPDATE_SELFSERVICE_DISPLAY_NAME</key>
		<string>Update %NAME%</string>
		<key>USERS_GROUP_NAME</key>
		<string>%NAME% users</string>
		<key>USERS_GROUP_TEMPLATE</key>
		<string>SmartGroup-users.xml</string>
	</dict>
	<key>MinimumVersion</key>
	<string>2.0.0</string>
	<key>Process</key>
	<array>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>recipeoverride_identifier</key>
				<string>%UNTESTED_RECIPE_IDENTIFIER%</string>
			</dict>
			<key>Processor</key>
			<string>com.github.grahampugh.recipes.preprocessors/LastRecipeRunChecker</string>
		</dict>
		<dict>
			<key>Processor</key>
			<string>com.github.grahampugh.recipes.commonprocessors/VersionRegexGenerator</string>
		</dict>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>category_name</key>
				<string>%TRIGGER_POLICY_CATEGORY%</string>
			</dict>
			<key>Processor</key>
			<string>com.github.grahampugh.jamf-upload.processors/JamfCategoryUploader</string>
		</dict>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>category_name</key>
				<string>%UPDATE_POLICY_CATEGORY%</string>
			</dict>
			<key>Processor</key>
			<string>com.github.grahampugh.jamf-upload.processors/JamfCategoryUploader</string>
		</dict>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>category_name</key>
				<string>%AUTOUPDATE_POLICY_CATEGORY%</string>
			</dict>
			<key>Processor</key>
			<string>com.github.grahampugh.jamf-upload.processors/JamfCategoryUploader</string>
		</dict>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>category_name</key>
				<string>%AUTOINSTALL_POLICY_CATEGORY%</string>
			</dict>
			<key>Processor</key>
			<string>com.github.grahampugh.jamf-upload.processors/JamfCategoryUploader</string>
		</dict>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>computergroup_name</key>
				<string>%USERS_GROUP_NAME%</string>
				<key>computergroup_template</key>
				<string>%USERS_GROUP_TEMPLATE%</string>
				<key>replace_group</key>
				<string>False</string>
			</dict>
			<key>Processor</key>
			<string>com.github.grahampugh.jamf-upload.processors/JamfComputerGroupUploader</string>
		</dict>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>computergroup_name</key>
				<string>%INSTALLED_GROUP_NAME%</string>
				<key>computergroup_template</key>
				<string>%INSTALLED_GROUP_TEMPLATE%</string>
				<key>replace_group</key>
				<string>True</string>
			</dict>
			<key>Processor</key>
			<string>com.github.grahampugh.jamf-upload.processors/JamfComputerGroupUploader</string>
		</dict>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>computergroup_name</key>
				<string>%AUTOINSTALL_ALL_SOFTWARE_GROUP_NAME%</string>
				<key>computergroup_template</key>
				<string>%AUTOINSTALL_ALL_SOFTWARE_GROUP_TEMPLATE%</string>
				<key>replace_group</key>
				<string>False</string>
			</dict>
			<key>Processor</key>
			<string>com.github.grahampugh.jamf-upload.processors/JamfComputerGroupUploader</string>
		</dict>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>computergroup_name</key>
				<string>%AUTOUPDATE_ALL_SOFTWARE_GROUP_NAME%</string>
				<key>computergroup_template</key>
				<string>%AUTOUPDATE_ALL_SOFTWARE_GROUP_TEMPLATE%</string>
				<key>replace_group</key>
				<string>False</string>
			</dict>
			<key>Processor</key>
			<string>com.github.grahampugh.jamf-upload.processors/JamfComputerGroupUploader</string>
		</dict>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>computergroup_name</key>
				<string>%AUTOINSTALL_GROUP_NAME%</string>
				<key>computergroup_template</key>
				<string>%AUTOINSTALL_GROUP_TEMPLATE%</string>
				<key>replace_group</key>
				<string>False</string>
			</dict>
			<key>Processor</key>
			<string>com.github.grahampugh.jamf-upload.processors/JamfComputerGroupUploader</string>
		</dict>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>computergroup_name</key>
				<string>%AUTOUPDATE_GROUP_NAME%</string>
				<key>computergroup_template</key>
				<string>%AUTOUPDATE_GROUP_TEMPLATE%</string>
				<key>replace_group</key>
				<string>False</string>
			</dict>
			<key>Processor</key>
			<string>com.github.grahampugh.jamf-upload.processors/JamfComputerGroupUploader</string>
		</dict>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>computergroup_name</key>
				<string>%PROD_VERSION_INSTALLED_GROUP_NAME%</string>
				<key>computergroup_template</key>
				<string>%PROD_VERSION_INSTALLED_GROUP_TEMPLATE%</string>
				<key>replace_group</key>
				<string>True</string>
			</dict>
			<key>Processor</key>
			<string>com.github.grahampugh.jamf-upload.processors/JamfComputerGroupUploader</string>
		</dict>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>icon</key>
				<string></string>
				<key>policy_name</key>
				<string>%TRIGGER_POLICY_NAME%</string>
				<key>policy_template</key>
				<string>%TRIGGER_POLICY_TEMPLATE%</string>
				<key>replace_policy</key>
				<string>True</string>
			</dict>
			<key>Comment</key>
			<string>Trigger-only policy</string>
			<key>Processor</key>
			<string>com.github.grahampugh.jamf-upload.processors/JamfPolicyUploader</string>
		</dict>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>icon</key>
				<string></string>
				<key>policy_name</key>
				<string>%AUTOINSTALL_POLICY_NAME%</string>
				<key>policy_template</key>
				<string>%AUTOINSTALL_POLICY_TEMPLATE%</string>
				<key>replace_policy</key>
				<string>False</string>
			</dict>
			<key>Comment</key>
			<string>Auto-install policy</string>
			<key>Processor</key>
			<string>com.github.grahampugh.jamf-upload.processors/JamfPolicyUploader</string>
		</dict>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>icon</key>
				<string></string>
				<key>policy_name</key>
				<string>%AUTOUPDATE_POLICY_NAME%</string>
				<key>policy_template</key>
				<string>%AUTOUPDATE_POLICY_TEMPLATE%</string>
				<key>replace_policy</key>
				<string>False</string>
			</dict>
			<key>Comment</key>
			<string>Auto-update policy</string>
			<key>Processor</key>
			<string>com.github.grahampugh.jamf-upload.processors/JamfPolicyUploader</string>
		</dict>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>SELFSERVICE_POLICY_CATEGORY</key>
				<string>%PKG_CATEGORY%</string>
				<key>icon</key>
				<string>%SELFSERVICE_ICON%</string>
				<key>policy_name</key>
				<string>%SELFSERVICE_POLICY_NAME%</string>
				<key>policy_template</key>
				<string>%SELFSERVICE_POLICY_TEMPLATE%</string>
				<key>replace_policy</key>
				<string>True</string>
			</dict>
			<key>Comment</key>
			<string>Self Service install policy</string>
			<key>Processor</key>
			<string>com.github.grahampugh.jamf-upload.processors/JamfPolicyUploader</string>
		</dict>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>icon</key>
				<string>%SELFSERVICE_ICON%</string>
				<key>policy_name</key>
				<string>%UPDATE_POLICY_NAME%</string>
				<key>policy_template</key>
				<string>%UPDATE_POLICY_TEMPLATE%</string>
				<key>replace_policy</key>
				<string>True</string>
			</dict>
			<key>Comment</key>
			<string>Self Service update policy</string>
			<key>Processor</key>
			<string>com.github.grahampugh.jamf-upload.processors/JamfPolicyUploader</string>
		</dict>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>policy_name</key>
				<string>%LAST_RUN_POLICY_NAME%</string>
			</dict>
			<key>Comment</key>
			<string>Delete the untested policy</string>
			<key>Processor</key>
			<string>com.github.grahampugh.jamf-upload.processors/JamfPolicyDeleter</string>
		</dict>
	</array>
</dict>
</plist>
