<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Description</key>
	<string>Uploads the pkg to the JSS, and creates a Self-Service Policy available to members of a Testing group.</string>
	<key>Identifier</key>
	<string>com.github.eth-its-recipes.jamf.AdoptOpenJDK8-prod</string>
	<key>Input</key>
	<dict>
		<key>EXTENSION_ATTRIBUTE_NAME</key>
		<string>AdoptOpenJDK8Version</string>
		<key>NAME</key>
		<string>AdoptOpenJDK 8</string>
		<key>PROD_VERSION_INSTALLED_GROUP_TEMPLATE</key>
		<string>SmartGroup-prod-version-installed-EA.xml</string>
		<key>SELFSERVICE_ICON</key>
		<string>AdoptOpenJDK.png</string>
		<key>UNTESTED_RECIPE_IDENTIFIER</key>
		<string>local.jamf.AdoptOpenJDK8</string>
	</dict>
	<key>MinimumVersion</key>
	<string>2.0.0</string>
	<key>ParentRecipe</key>
	<string>com.github.eth-its-recipes.jamf.template-prod</string>
</dict>
</plist>
