<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Description</key>
	<string>Creates a Self-Service Policy available to members of a Testing group.</string>
	<key>Identifier</key>
	<string>com.github.eth-its-recipes.jamf.macos-bigsur-upgrade-nodes</string>
	<key>Input</key>
	<dict>
		<key>INSTALL_BUTTON_TEXT</key>
		<string>Upgrade macOS</string>
		<key>MAX_OS_VERSION</key>
		<string>10.15.8</string>
		<key>MODEL_IDENTIFIER_REGEX</key>
		<string>^(iMac14,4|iMac1[5-9]|iMac2[0-9]|iMacPro|MacBook[8-9]|MacBook1[0-9]|MacBookAir[6-9]|MacBookAir1[0-9]|MacBookPro1[1-6]|Macmini[7-9]|MacPro[6-9])</string>
		<key>NAME</key>
		<string>Upgrade to macOS Big Sur</string>
		<key>POLICY_NAME</key>
		<string>Upgrade to macOS Big Sur v%version%</string>
		<key>POLICY_RUN_COMMAND</key>
		<string>/Library/Management/erase-install/erase-install.sh --os=11.0 --overwrite --move --reinstall</string>
		<key>REINSTALL_BUTTON_TEXT</key>
		<string>Upgrade macOS</string>
		<key>SELFSERVICE_DESCRIPTION</key>
		<string>WARNING! This will download the latest version of macOS Big Sur and install it on the system volume. All work should be saved and backed up before starting.</string>
		<key>SELFSERVICE_DISPLAY_NAME</key>
		<string>Upgrade to macOS Big Sur v%version%</string>
		<key>SELFSERVICE_ICON</key>
		<string>Install macOS Big Sur.png</string>
		<key>UNTESTED_RECIPE_IDENTIFIER</key>
		<string>local.jamf.macOSBigSur-upgrade</string>
	</dict>
	<key>MinimumVersion</key>
	<string>2.0.0</string>
	<key>ParentRecipe</key>
	<string>com.github.eth-its-recipes.jamf.template-nodes</string>
</dict>
</plist>
