Description: Uploads the pkg to the JSS, and creates a Self-Service Policy available to members of a Testing group.
Identifier: com.github.eth-its-recipes.jamf.rosetta
MinimumVersion: 1.0.0
ParentRecipe: com.github.grahampugh.recipes.pkg.rosetta

Input:
  NAME: Rosetta 2
  PKG_CATEGORY: Administration
  POLICY_CATEGORY: Administration
  POLICY_NAME: "0001 - Install Rosetta 2"
  POLICY_TEMPLATE: Policy-all-computers-once-per-computer.xml
  EXTENSION_ATTRIBUTE_NAME: Rosetta 2
  EXTENSION_ATTRIBUTE_SCRIPT: Rosetta-EA.sh
  EXTENSION_ATTRIBUTE_VALUE: "installed"
  EXTENSION_ATTRIBUTE_VALUE_2: "ineligible"
  AUTOINSTALL_GROUP_NAME: "%NAME% auto-install"
  AUTOINSTALL_GROUP_TEMPLATE: SmartGroup-rosetta-autoinstall.xml
  INSTALLED_GROUP_NAME: "%NAME% installed or ineligible"
  INSTALLED_GROUP_TEMPLATE: SmartGroup-installed-rosetta.xml
  AUTOINSTALL_POLICY_NAME: "Auto-install %NAME%"
  AUTOINSTALL_POLICY_TEMPLATE: Policy-prod-autoinstall-script-only.xml
  AUTOINSTALL_POLICY_CATEGORY: Auto-installers
  AUTOINSTALL_POLICY_FREQUENCY: Once every day
  TRIGGER_POLICY_RUN_COMMAND: "echo 'Installation of %NAME% complete'"
  UPDATE_PREDICATE: "pkg_uploaded == False"

Process:
  - Processor: com.github.grahampugh.jamf-upload.processors/JamfCategoryUploader
    Arguments:
      category_name: "%PKG_CATEGORY%"

  - Processor: com.github.grahampugh.jamf-upload.processors/JamfPackageUploader
    Arguments:
      pkg_category: "%PKG_CATEGORY%"

  - Processor: com.github.grahampugh.recipes.commonprocessors/WritePkgResultToJson

  - Processor: StopProcessingIf
    Arguments:
      predicate: "%UPDATE_PREDICATE%"

  - Processor: com.github.grahampugh.jamf-upload.processors/JamfExtensionAttributeUploader
    Arguments:
      ea_script_path: "%EXTENSION_ATTRIBUTE_SCRIPT%"
      ea_name: "%EXTENSION_ATTRIBUTE_NAME%"
      replace_ea: "True"

  - Processor: com.github.grahampugh.jamf-upload.processors/JamfComputerGroupUploader
    Arguments:
      computergroup_name: "%INSTALLED_GROUP_NAME%"
      computergroup_template: "%INSTALLED_GROUP_TEMPLATE%"
      replace_group: "True"

  - Processor: com.github.grahampugh.jamf-upload.processors/JamfComputerGroupUploader
    Arguments:
      computergroup_name: "%AUTOINSTALL_GROUP_NAME%"
      computergroup_template: "%AUTOINSTALL_GROUP_TEMPLATE%"
      replace_group: "True"

  - Processor: com.github.grahampugh.jamf-upload.processors/JamfPolicyUploader
    Comment: Auto-install policy
    Arguments:
      policy_template: "%AUTOINSTALL_POLICY_TEMPLATE%"
      policy_name: "%AUTOINSTALL_POLICY_NAME%"
      icon: ""
      replace_policy: "True"

  - Processor: com.github.grahampugh.jamf-upload.processors/JamfPolicyUploader
    Arguments:
      policy_template: "%POLICY_TEMPLATE%"
      policy_name: "%POLICY_NAME%"
      replace_policy: "True"

  - Processor: com.github.grahampugh.recipes.postprocessors/LastRecipeRunResult
