<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Description</key>
	<string>Creates a Self-Service Policy available to members of a Testing group.</string>
	<key>Identifier</key>
	<string>com.github.eth-its-recipes.jamf.AdoptOpenJDK11-nodes</string>
	<key>Input</key>
	<dict>
		<key>EXTENSION_ATTRIBUTE_NAME</key>
		<string>AdoptOpenJDK11Version</string>
		<key>EXTENSION_ATTRIBUTE_SCRIPT</key>
		<string>AdoptOpenJDK-EA.sh</string>
		<key>EXTENSION_ATTRIBUTE_VALUE</key>
		<string>11</string>
		<key>NAME</key>
		<string>AdoptOpenJDK 11</string>
		<key>SELFSERVICE_ICON</key>
		<string>AdoptOpenJDK.png</string>
		<key>UNTESTED_RECIPE_IDENTIFIER</key>
		<string>local.jamf.AdoptOpenJDK11</string>
	</dict>
	<key>MinimumVersion</key>
	<string>2.0.0</string>
	<key>ParentRecipe</key>
	<string>com.github.eth-its-recipes.jamf.template-EA-nodes</string>
</dict>
</plist>
