<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Description</key>
	<string>Creates a Self-Service Policy available to members of a Testing group.</string>
	<key>Identifier</key>
	<string>com.github.eth-its-recipes.jamf.AdoptOpenJDK8-nodes</string>
	<key>Input</key>
	<dict>
		<key>EXTENSION_ATTRIBUTE_NAME</key>
		<string>AdoptOpenJDK8Version</string>
		<key>EXTENSION_ATTRIBUTE_SCRIPT</key>
		<string>AdoptOpenJDK-EA.sh</string>
		<key>EXTENSION_ATTRIBUTE_VALUE</key>
		<string>8</string>
		<key>NAME</key>
		<string>AdoptOpenJDK 8</string>
		<key>PARAMETER4_LABEL</key>
		<string>JDK major version</string>
		<key>PARAMETER4_VALUE</key>
		<string>8</string>
		<key>POLICY_TEMPLATE</key>
		<string>Policy-untested-selfservice-script-parameter4.xml</string>
		<key>SCRIPT_CATEGORY</key>
		<string>Uninstallers</string>
		<key>SCRIPT_NAME</key>
		<string>AdoptOpenJDK-uninstall.sh</string>
		<key>SCRIPT_PATH</key>
		<string>AdoptOpenJDK-uninstall.sh</string>
		<key>SCRIPT_PRIORITY</key>
		<string>Before</string>
		<key>SELFSERVICE_ICON</key>
		<string>AdoptOpenJDK.png</string>
		<key>TEST_VERSION_INSTALLED_GROUP_TEMPLATE</key>
		<string>SmartGroup-test-version-installed-EA.xml</string>
		<key>UNTESTED_RECIPE_IDENTIFIER</key>
		<string>local.jamf.AdoptOpenJDK8</string>
	</dict>
	<key>MinimumVersion</key>
	<string>2.0.0</string>
	<key>ParentRecipe</key>
	<string>com.github.eth-its-recipes.jamf.template-EA-script-nodes</string>
</dict>
</plist>
