<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Description</key>
	<string>Creates a Self-Service Policy available to members of a Testing group.</string>
	<key>Identifier</key>
	<string>com.github.eth-its-recipes.jamf.CarbonCopyCloner-nodes</string>
	<key>Input</key>
	<dict>
		<key>LANGUAGE</key>
		<string>EN</string>
		<key>NAME</key>
		<string>Carbon Copy Cloner</string>
		<key>POLICY_NAME</key>
		<string>%NAME% %LANGUAGE% (Testing)</string>
		<key>TEST_USERS_GROUP_NAME</key>
		<string>%NAME% %LANGUAGE% test users</string>
		<key>TEST_VERSION_INSTALLED_GROUP_NAME</key>
		<string>%NAME% %LANGUAGE% test version installed</string>
		<key>UNTESTED_RECIPE_IDENTIFIER</key>
		<string>local.jamf.CarbonCopyCloner</string>
	</dict>
	<key>MinimumVersion</key>
	<string>2.0.0</string>
	<key>ParentRecipe</key>
	<string>com.github.eth-its-recipes.jamf.template-nodes</string>
</dict>
</plist>
