<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Description</key>
	<string>Creates a Self-Service Policy available to members of a Testing group.</string>
	<key>Identifier</key>
	<string>com.github.eth-its-recipes.jamf.ETHPrinters-nodes</string>
	<key>Input</key>
	<dict>
		<key>NAME</key>
		<string>ETH Printers</string>
		<key>POLICY_NAME</key>
		<string>%NAME% (Testing)</string>
		<key>SCRIPT_NAME</key>
		<string>ETHPrinters-preinstall.sh</string>
		<key>SCRIPT_PATH</key>
		<string>ETHPrinters-preinstall.sh</string>
		<key>SCRIPT_PRIORITY</key>
		<string>Before</string>
		<key>SELFSERVICE_DISPLAY_NAME</key>
		<string>%NAME% (Testing)</string>
		<key>UNTESTED_RECIPE_IDENTIFIER</key>
		<string>local.jamf.ETHPrinters</string>
	</dict>
	<key>MinimumVersion</key>
	<string>2.0.0</string>
	<key>ParentRecipe</key>
	<string>com.github.eth-its-recipes.jamf.template-script-nodes</string>
</dict>
</plist>
