Description: Uploads the pkg to the JSS, and creates a Self-Service Policy available to members of a Testing group.
Identifier: com.github.eth-its-recipes.jamf.CiscoAnyConnect-nodes
ParentRecipe: com.github.eth-its-recipes.jamf.template-nodes
MinimumVersion: 2.0.0

Input:
  NAME: Cisco AnyConnect Secure Mobility Client
  UNTESTED_RECIPE_IDENTIFIER: local.jamf.CiscoAnyConnect
  POLICY_NAME: "Visual Studio Code v%version%"
  SELFSERVICE_DISPLAY_NAME: "Cisco AnyConnect Secure Mobility Client v%version%"
