Description: Uploads the pkg to the JSS, and creates a Self-Service Policy available to members of a Testing group.
Identifier: com.github.eth-its-recipes.jamf.MendeleyReferenceManager-nodes
ParentRecipe: com.github.eth-its-recipes.jamf.template-nodes
MinimumVersion: 2.0.0

Input:
  NAME: Mendeley Reference Manager
  UNTESTED_RECIPE_IDENTIFIER: local.jamf.MendeleyReferenceManager
  POLICY_NAME: "Mendeley Reference Manager v%version%"
  SELFSERVICE_DISPLAY_NAME: "Mendeley Reference Manager v%version%"
