Description: Uploads the pkg to the JSS, and creates a Self-Service Policy available to members of a Testing group.
Identifier: com.github.eth-its-recipes.jamf.VisualStudioCode-nodes
ParentRecipe: com.github.eth-its-recipes.jamf.template-nodes
MinimumVersion: 2.0.0

Input:
  NAME: Visual Studio Code
  UNTESTED_RECIPE_IDENTIFIER: local.jamf.VisualStudioCode
  POLICY_NAME: "Visual Studio Code v%version%"
  SELFSERVICE_DISPLAY_NAME: "Visual Studio Code v%version%"
  POLICY_RUN_COMMAND: 'chown -R "$(stat -f%Su /dev/console)" "/Applications/%NAME%.app" &amp;&amp; echo "Corrected permissions for %NAME%."'
