Description: Creates a Self-Service Policy available to members of a Testing group.
Identifier: com.github.eth-its-recipes.jamf.AdoptOpenJDK11-nodes
ParentRecipe: com.github.eth-its-recipes.jamf.template-EA-nodes
MinimumVersion: 2.0.0

Input:
  NAME: AdoptOpenJDK 11
  UNTESTED_RECIPE_IDENTIFIER: local.jamf.AdoptOpenJDK11
  EXTENSION_ATTRIBUTE_NAME: "AdoptOpenJDK11Version"
  EXTENSION_ATTRIBUTE_SCRIPT: AdoptOpenJDK-EA.sh
  EXTENSION_ATTRIBUTE_VALUE: "11"
  SELFSERVICE_ICON: AdoptOpenJDK.png
  TEST_VERSION_INSTALLED_GROUP_TEMPLATE: SmartGroup-test-version-installed-EA.xml
