Description: Creates a Self-Service Policy available to members of a Testing group.
Identifier: com.github.eth-its-recipes.jamf.CarbonCopyCloner-nodes
ParentRecipe: com.github.eth-its-recipes.jamf.template-nodes
MinimumVersion: 2.0.0

Input:
  NAME: Carbon Copy Cloner
  LANGUAGE: EN
  UNTESTED_RECIPE_IDENTIFIER: local.jamf.CarbonCopyCloner
  POLICY_NAME: "%NAME% %LANGUAGE% (Testing)"
  SELFSERVICE_DISPLAY_NAME: "%NAME% %LANGUAGE% (Testing)"
  TEST_VERSION_INSTALLED_GROUP_NAME: "%NAME% %LANGUAGE% test version installed"
  TEST_USERS_GROUP_NAME: "%NAME% %LANGUAGE% test users"
