Description: Creates a Self-Service Policy available to members of a Testing group.
Identifier: com.github.eth-its-recipes.jamf.macos-catalina-download-nodes
ParentRecipe: com.github.eth-its-recipes.jamf.template-nodes
MinimumVersion: 2.0.0

Input:
  NAME: Download macOS Catalina Installer
  UNTESTED_RECIPE_IDENTIFIER: local.jamf.macOSCatalina-download
  POLICY_RUN_COMMAND: /Library/Management/erase-install/erase-install.sh --os=10.15 --overwrite --move
  MODEL_IDENTIFIER_REGEX: ^(iMac1[3-9]|iMac2[0-9]|iMacPro|MacBook[8-9]|MacBook1[0-9]|MacBookAir[5-9]|MacBookAir1[0-9]|MacBookPro9|MacBookPro1[0-6]|MacMini[6-9]|MacPro[5-9])
  SELFSERVICE_ICON: Install macOS Catalina.png
  INSTALL_BUTTON_TEXT: Download
  REINSTALL_BUTTON_TEXT: Download
  TEST_VERSION_INSTALLED_GROUP_NAME: "%NAME% ineligible"
  TEST_VERSION_INSTALLED_GROUP_TEMPLATE: SmartGroup-macOS-download-ineligible.xml
