Description: Creates a Self-Service Policy available to members of a Testing group.
Identifier: com.github.eth-its-recipes.jamf.macos-bigsur-upgrade-nodes
ParentRecipe: com.github.eth-its-recipes.jamf.template-nodes
MinimumVersion: 2.0.0

Input:
  NAME: Upgrade to macOS Big Sur
  UNTESTED_RECIPE_IDENTIFIER: local.jamf.macOSBigSur-upgrade
  POLICY_RUN_COMMAND: /Library/Management/erase-install/erase-install.sh --os=11.0 --overwrite --move --reinstall
  MAX_OS_VERSION: 10.15.8
  MODEL_IDENTIFIER_REGEX: ^(iMac14,4|iMac1[5-9]|iMac2[0-9]|iMacPro|MacBook[8-9]|MacBook1[0-9]|MacBookAir[6-9]|MacBookAir1[0-9]|MacBookPro1[1-6]|Macmini[7-9]|MacPro[6-9])
  SELFSERVICE_DESCRIPTION: WARNING! This will download the latest version of macOS Big Sur and install it on the system volume. All work should be saved and backed up before starting.
  SELFSERVICE_ICON: Install macOS Big Sur.png
  INSTALL_BUTTON_TEXT: Upgrade macOS
  REINSTALL_BUTTON_TEXT: Upgrade macOS
  TEST_VERSION_INSTALLED_GROUP_NAME: "%NAME% ineligible"
  TEST_VERSION_INSTALLED_GROUP_TEMPLATE: SmartGroup-macOS-upgrade-ineligible.xml
