<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
	<dict>
		<key>Description</key>
		<string>Uploads the pkg to the JSS, and creates a Self-Service Policy available to members of a Testing group.</string>
		<key>Identifier</key>
		<string>com.github.eth-its-recipes.jamf.AdoptOpenJDK8</string>
		<key>Input</key>
		<dict>
			<key>EXTENSION_ATTRIBUTE_NAME</key>
			<string>AdoptOpenJDK8Version</string>
			<key>EXTENSION_ATTRIBUTE_SCRIPT</key>
			<string>AdoptOpenJDK-EA.sh</string>
			<key>EXTENSION_ATTRIBUTE_VALUE</key>
			<string>8</string>
			<key>INSTALL_BUTTON_TEXT</key>
			<string>Install %version%</string>
			<key>NAME</key>
			<string>AdoptOpenJDK 8</string>
			<key>PARAMETER4_LABEL</key>
			<string>JDK major version</string>
			<key>PARAMETER4_VALUE</key>
			<string>8</string>
			<key>PKG_CATEGORY</key>
			<string>Development &amp; Computing</string>
			<key>POLICY_CATEGORY</key>
			<string>Untested</string>
			<key>POLICY_NAME</key>
			<string>%NAME% (Testing)</string>
			<key>POLICY_RUN_COMMAND</key>
			<string>echo 'Installation of %NAME% complete'</string>
			<key>POLICY_TEMPLATE</key>
			<string>Policy-untested-selfservice-script-parameter4.xml</string>
			<key>REINSTALL_BUTTON_TEXT</key>
			<string>Install %version%</string>
			<key>SCRIPT_CATEGORY</key>
			<string>Uninstallers</string>
			<key>SCRIPT_NAME</key>
			<string>AdoptOpenJDK-uninstall.sh</string>
			<key>SCRIPT_PATH</key>
			<string>AdoptOpenJDK-uninstall.sh</string>
			<key>SCRIPT_PRIORITY</key>
			<string>Before</string>
			<key>SELFSERVICE_DESCRIPTION</key>
			<string>‎The AdoptOpenJDK Java Developement Toolkit, version 8.

Version: %version%
Category: %PKG_CATEGORY%
			</string>
			<key>SELFSERVICE_DISPLAY_NAME</key>
			<string>%NAME% (Testing)</string>
			<key>SELFSERVICE_ICON</key>
			<string>AdoptOpenJDK.png</string>
			<key>TESTING_GROUP_NAME</key>
			<string>Testing</string>
			<key>TESTING_GROUP_TEMPLATE</key>
			<string>StaticGroup-testing.xml</string>
			<key>TEST_USERS_GROUP_NAME</key>
			<string>%NAME% test users</string>
			<key>TEST_USERS_GROUP_TEMPLATE</key>
			<string>SmartGroup-test-users.xml</string>
			<key>TEST_VERSION_INSTALLED_GROUP_NAME</key>
			<string>%NAME% test version installed</string>
			<key>TEST_VERSION_INSTALLED_GROUP_TEMPLATE</key>
			<string>SmartGroup-test-version-installed-EA.xml</string>
			<key>UPDATE_PREDICATE</key>
			<string>pkg_uploaded != True</string>
		</dict>
		<key>MinimumVersion</key>
		<string>2.0.0</string>
		<key>ParentRecipe</key>
		<string>com.github.grahampugh.recipes.pkg.AdoptOpenJDK8</string>
		<key>Process</key>
		<array>
			<dict>
				<key>Processor</key>
				<string>com.github.grahampugh.recipes.commonprocessors/VersionRegexGenerator</string>
			</dict>
			<dict>
				<key>Arguments</key>
				<dict>
					<key>category_name</key>
					<string>%PKG_CATEGORY%</string>
				</dict>
				<key>Processor</key>
				<string>com.github.grahampugh.jamf-upload.processors/JamfCategoryUploader</string>
			</dict>
			<dict>
				<key>Arguments</key>
				<dict>
					<key>pkg_category</key>
					<string>%PKG_CATEGORY%</string>
				</dict>
				<key>Processor</key>
				<string>com.github.grahampugh.jamf-upload.processors/JamfPackageUploader</string>
			</dict>
			<dict>
				<key>Processor</key>
				<string>com.github.grahampugh.recipes.commonprocessors/WritePkgResultToJson</string>
			</dict>
			<dict>
				<key>Arguments</key>
				<dict>
					<key>predicate</key>
					<string>%UPDATE_PREDICATE%</string>
				</dict>
				<key>Processor</key>
				<string>StopProcessingIf</string>
			</dict>
			<dict>
				<key>Arguments</key>
				<dict>
					<key>category_name</key>
					<string>%POLICY_CATEGORY%</string>
				</dict>
				<key>Processor</key>
				<string>com.github.grahampugh.jamf-upload.processors/JamfCategoryUploader</string>
			</dict>
			<dict>
				<key>Arguments</key>
				<dict>
					<key>category_name</key>
					<string>%SCRIPT_CATEGORY%</string>
				</dict>
				<key>Processor</key>
				<string>com.github.grahampugh.jamf-upload.processors/JamfCategoryUploader</string>
			</dict>
			<dict>
				<key>Arguments</key>
				<dict>
					<key>replace_script</key>
					<true/>
					<key>script_category</key>
					<string>%SCRIPT_CATEGORY%</string>
					<key>script_name</key>
					<string>%SCRIPT_NAME%</string>
					<key>script_parameter4</key>
					<string>%PARAMETER4_LABEL%</string>
					<key>script_path</key>
					<string>%SCRIPT_PATH%</string>
					<key>script_priority</key>
					<string>%SCRIPT_PRIORITY%</string>
				</dict>
				<key>Processor</key>
				<string>com.github.grahampugh.jamf-upload.processors/JamfScriptUploader</string>
			</dict>
			<dict>
				<key>Arguments</key>
				<dict>
					<key>ea_name</key>
					<string>%EXTENSION_ATTRIBUTE_NAME%</string>
					<key>ea_script_path</key>
					<string>%EXTENSION_ATTRIBUTE_SCRIPT%</string>
					<key>replace_ea</key>
					<string>True</string>
				</dict>
				<key>Processor</key>
				<string>com.github.grahampugh.jamf-upload.processors/JamfExtensionAttributeUploader</string>
			</dict>
			<dict>
				<key>Arguments</key>
				<dict>
					<key>computergroup_name</key>
					<string>%TESTING_GROUP_NAME%</string>
					<key>computergroup_template</key>
					<string>%TESTING_GROUP_TEMPLATE%</string>
					<key>replace_group</key>
					<string>False</string>
				</dict>
				<key>Processor</key>
				<string>com.github.grahampugh.jamf-upload.processors/JamfComputerGroupUploader</string>
			</dict>
			<dict>
				<key>Arguments</key>
				<dict>
					<key>computergroup_name</key>
					<string>%TEST_USERS_GROUP_NAME%</string>
					<key>computergroup_template</key>
					<string>%TEST_USERS_GROUP_TEMPLATE%</string>
					<key>replace_group</key>
					<string>False</string>
				</dict>
				<key>Processor</key>
				<string>com.github.grahampugh.jamf-upload.processors/JamfComputerGroupUploader</string>
			</dict>
			<dict>
				<key>Arguments</key>
				<dict>
					<key>computergroup_name</key>
					<string>%TEST_VERSION_INSTALLED_GROUP_NAME%</string>
					<key>computergroup_template</key>
					<string>%TEST_VERSION_INSTALLED_GROUP_TEMPLATE%</string>
					<key>replace_group</key>
					<string>True</string>
				</dict>
				<key>Processor</key>
				<string>com.github.grahampugh.jamf-upload.processors/JamfComputerGroupUploader</string>
			</dict>
			<dict>
				<key>Arguments</key>
				<dict>
					<key>icon</key>
					<string>%SELFSERVICE_ICON%</string>
					<key>policy_name</key>
					<string>%POLICY_NAME%</string>
					<key>policy_template</key>
					<string>%POLICY_TEMPLATE%</string>
					<key>replace_policy</key>
					<string>True</string>
				</dict>
				<key>Processor</key>
				<string>com.github.grahampugh.jamf-upload.processors/JamfPolicyUploader</string>
			</dict>
			<dict>
				<key>Processor</key>
				<string>com.github.grahampugh.recipes.postprocessors/LastRecipeRunResult</string>
			</dict>
		</array>
	</dict>
</plist>
