<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Description</key>
	<string>Uploads the pkg to the JSS, and creates a Self-Service Policy available to members of a Testing group. The CLC_LICENSE_SERVER and CLC_LICENSE_PORT keys should be overridden.</string>
	<key>Identifier</key>
	<string>com.github.eth-its-recipes.jamf.CLCGenomicsWorkbench</string>
	<key>Input</key>
	<dict>
		<key>CLC_LICENSE_PORT</key>
		<string>++ REPLACE-ME ++</string>
		<key>CLC_LICENSE_SERVER</key>
		<string>++ REPLACE-ME ++</string>
		<key>INSTALL_BUTTON_TEXT</key>
		<string>Install %version%</string>
		<key>JSS_INVENTORY_NAME</key>
		<string>CLC Genomics Workbench 20.app</string>
		<key>LANGUAGE</key>
		<string>EN</string>
		<key>LIST_LANGUAGE</key>
		<string>EN</string>
		<key>LIST_NAME</key>
		<string>CLC Genomics Workbench</string>
		<key>MAJOR_VERSION</key>
		<string>20</string>
		<key>NAME</key>
		<string>CLC Genomics Workbench</string>
		<key>PKG_CATEGORY</key>
		<string>Science &amp; Math</string>
		<key>POLICY_CATEGORY</key>
		<string>Untested</string>
		<key>POLICY_NAME</key>
		<string>%NAME% %MAJOR_VERSION% %LANGUAGE% (Testing)</string>
		<key>POLICY_RUN_COMMAND</key>
		<string>chown -R "$(stat -f%Su /dev/console):staff" "/Applications/%NAME% %MAJOR_VERSION%" &amp;&amp; echo "Corrected permissions for %NAME% %MAJOR_VERSION%."</string>
		<key>POLICY_TEMPLATE</key>
		<string>Policy-untested-selfservice.xml</string>
		<key>REINSTALL_BUTTON_TEXT</key>
		<string>Install %version%</string>
		<key>SELFSERVICE_DESCRIPTION</key>
		<string>**CLC Genomics Workbench 20** - a software package supporting your daily bioinformatics work.

**Note**
On macOS 10.14+, during installation you may be asked to allow "Installer.app" to control "System Events.app". This is required for installation to proceed. It does not require administrator rights.
After installation is complete, as a security measure you can disallow access by going to **System Preferences - Security and Privacy - Privacy - Automation** and un-checking "System Events.app" in the "Installer.app" item.

Version: %version%
Category: %PKG_CATEGORY%
</string>
		<key>SELFSERVICE_DISPLAY_NAME</key>
		<string>%NAME% %MAJOR_VERSION% %LANGUAGE% (Testing)</string>
		<key>SELFSERVICE_ICON</key>
		<string>%NAME%.png</string>
		<key>TESTING_GROUP_NAME</key>
		<string>Testing</string>
		<key>TESTING_GROUP_TEMPLATE</key>
		<string>StaticGroup-testing.xml</string>
		<key>TEST_USERS_GROUP_NAME</key>
		<string>%NAME% %MAJOR_VERSION% %LANGUAGE% test users</string>
		<key>TEST_USERS_GROUP_TEMPLATE</key>
		<string>SmartGroup-test-users.xml</string>
		<key>TEST_VERSION_INSTALLED_GROUP_NAME</key>
		<string>%NAME% %MAJOR_VERSION% %LANGUAGE% test version installed</string>
		<key>TEST_VERSION_INSTALLED_GROUP_TEMPLATE</key>
		<string>SmartGroup-test-version-installed.xml</string>
		<key>UPDATE_PREDICATE</key>
		<string>pkg_uploaded != True</string>
	</dict>
	<key>MinimumVersion</key>
	<string>2.0.0</string>
	<key>ParentRecipe</key>
	<string>com.github.eth-its-recipes.pkg.CLCGenomicsWorkbench</string>
	<key>Process</key>
	<array>
		<dict>
			<key>Processor</key>
			<string>com.github.grahampugh.recipes.commonprocessors/VersionRegexGenerator</string>
		</dict>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>category_name</key>
				<string>%PKG_CATEGORY%</string>
			</dict>
			<key>Processor</key>
			<string>com.github.grahampugh.jamf-upload.processors/JamfCategoryUploader</string>
		</dict>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>pkg_category</key>
				<string>%PKG_CATEGORY%</string>
			</dict>
			<key>Processor</key>
			<string>com.github.grahampugh.jamf-upload.processors/JamfPackageUploader</string>
		</dict>
		<dict>
			<key>Processor</key>
			<string>com.github.grahampugh.recipes.commonprocessors/WritePkgResultToJson</string>
		</dict>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>predicate</key>
				<string>%UPDATE_PREDICATE%</string>
			</dict>
			<key>Processor</key>
			<string>StopProcessingIf</string>
		</dict>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>category_name</key>
				<string>%POLICY_CATEGORY%</string>
			</dict>
			<key>Processor</key>
			<string>com.github.grahampugh.jamf-upload.processors/JamfCategoryUploader</string>
		</dict>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>computergroup_name</key>
				<string>%TESTING_GROUP_NAME%</string>
				<key>computergroup_template</key>
				<string>%TESTING_GROUP_TEMPLATE%</string>
				<key>replace_group</key>
				<string>False</string>
			</dict>
			<key>Processor</key>
			<string>com.github.grahampugh.jamf-upload.processors/JamfComputerGroupUploader</string>
		</dict>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>computergroup_name</key>
				<string>%TEST_USERS_GROUP_NAME%</string>
				<key>computergroup_template</key>
				<string>%TEST_USERS_GROUP_TEMPLATE%</string>
				<key>replace_group</key>
				<string>False</string>
			</dict>
			<key>Processor</key>
			<string>com.github.grahampugh.jamf-upload.processors/JamfComputerGroupUploader</string>
		</dict>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>computergroup_name</key>
				<string>%TEST_VERSION_INSTALLED_GROUP_NAME%</string>
				<key>computergroup_template</key>
				<string>%TEST_VERSION_INSTALLED_GROUP_TEMPLATE%</string>
				<key>replace_group</key>
				<string>True</string>
			</dict>
			<key>Processor</key>
			<string>com.github.grahampugh.jamf-upload.processors/JamfComputerGroupUploader</string>
		</dict>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>icon</key>
				<string>%SELFSERVICE_ICON%</string>
				<key>policy_name</key>
				<string>%POLICY_NAME%</string>
				<key>policy_template</key>
				<string>%POLICY_TEMPLATE%</string>
				<key>replace_policy</key>
				<string>True</string>
			</dict>
			<key>Processor</key>
			<string>com.github.grahampugh.jamf-upload.processors/JamfPolicyUploader</string>
		</dict>
		<dict>
			<key>Processor</key>
			<string>com.github.grahampugh.recipes.postprocessors/LastRecipeRunResult</string>
		</dict>
	</array>
</dict>
</plist>
