<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Description</key>
	<string>Uploads the pkg to the JSS, and creates a Self-Service Policy available to members of a Testing group.</string>
	<key>Identifier</key>
	<string>com.github.eth-its-recipes.jamf.macos-bigsur-download</string>
	<key>Input</key>
	<dict>
		<key>INELIGIBLE_GROUP_NAME</key>
		<string>%NAME% ineligible</string>
		<key>INELIGIBLE_GROUP_TEMPLATE</key>
		<string>SmartGroup-macOS-download-ineligible.xml</string>
		<key>INSTALL_BUTTON_TEXT</key>
		<string>Download</string>
		<key>MAX_OS_VERSION</key>
		<string>11.99</string>
		<key>MIN_OS_VERSION</key>
		<string>10.12.4</string>
		<key>MODEL_IDENTIFIER_REGEX</key>
		<string>^(iMac14,4|iMac1[5-9]|iMac2[0-9]|iMacPro|MacBook[8-9]|MacBook1[0-9]|MacBookAir[6-9]|MacBookAir1[0-9]|MacBookPro1[1-6]|Macmini[7-9]|MacPro[6-9])</string>
		<key>NAME</key>
		<string>Download macOS Big Sur Installer</string>
		<key>PKG_CATEGORY</key>
		<string>Updates</string>
		<key>POLICY_CATEGORY</key>
		<string>Untested</string>
		<key>POLICY_NAME</key>
		<string>%NAME% (Testing)</string>
		<key>POLICY_RUN_COMMAND</key>
		<string>/Library/Management/erase-install/erase-install.sh --os=11 --update --move</string>
		<key>POLICY_TEMPLATE</key>
		<string>Policy-untested-selfservice-macOS.xml</string>
		<key>REINSTALL_BUTTON_TEXT</key>
		<string>Download</string>
		<key>SELFSERVICE_DESCRIPTION</key>
		<string>Downloads 'Install macOS Big Sur.app' to the Applications folder, which can then be run manaully to reinstall macOS. If there are any existing macOS installers present in the Applications folder, this will replace them.
</string>
		<key>SELFSERVICE_DISPLAY_NAME</key>
		<string>%NAME% (Testing)</string>
		<key>SELFSERVICE_ICON</key>
		<string>Install macOS Big Sur.png</string>
		<key>TESTING_GROUP_NAME</key>
		<string>Testing</string>
		<key>TESTING_GROUP_TEMPLATE</key>
		<string>StaticGroup-testing.xml</string>
		<key>TEST_USERS_GROUP_NAME</key>
		<string>%NAME% test users</string>
		<key>TEST_USERS_GROUP_TEMPLATE</key>
		<string>SmartGroup-test-users.xml</string>
		<key>UNTESTED_RECIPE_IDENTIFIER</key>
		<string>local.jamf.macOS-erase-install</string>
		<key>UPDATE_PREDICATE</key>
		<string>pkg_uploaded == False</string>
	</dict>
	<key>MinimumVersion</key>
	<string>1.0.0</string>
	<key>Process</key>
	<array>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>recipeoverride_identifier</key>
				<string>%UNTESTED_RECIPE_IDENTIFIER%</string>
			</dict>
			<key>Processor</key>
			<string>com.github.grahampugh.recipes.preprocessors/LastRecipeRunChecker</string>
		</dict>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>predicate</key>
				<string>%UPDATE_PREDICATE%</string>
			</dict>
			<key>Processor</key>
			<string>StopProcessingIf</string>
		</dict>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>category_name</key>
				<string>%PKG_CATEGORY%</string>
			</dict>
			<key>Processor</key>
			<string>com.github.grahampugh.jamf-upload.processors/JamfCategoryUploader</string>
		</dict>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>pkg_category</key>
				<string>%PKG_CATEGORY%</string>
				<key>replace_pkg</key>
				<string>False</string>
				<key>replace_pkg_metadata</key>
				<string>True</string>
			</dict>
			<key>Processor</key>
			<string>com.github.grahampugh.jamf-upload.processors/JamfPackageUploader</string>
		</dict>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>category_name</key>
				<string>%POLICY_CATEGORY%</string>
			</dict>
			<key>Processor</key>
			<string>com.github.grahampugh.jamf-upload.processors/JamfCategoryUploader</string>
		</dict>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>computergroup_name</key>
				<string>%TESTING_GROUP_NAME%</string>
				<key>computergroup_template</key>
				<string>%TESTING_GROUP_TEMPLATE%</string>
				<key>replace_group</key>
				<string>False</string>
			</dict>
			<key>Processor</key>
			<string>com.github.grahampugh.jamf-upload.processors/JamfComputerGroupUploader</string>
		</dict>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>computergroup_name</key>
				<string>%TEST_USERS_GROUP_NAME%</string>
				<key>computergroup_template</key>
				<string>%TEST_USERS_GROUP_TEMPLATE%</string>
				<key>replace_group</key>
				<string>False</string>
			</dict>
			<key>Processor</key>
			<string>com.github.grahampugh.jamf-upload.processors/JamfComputerGroupUploader</string>
		</dict>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>computergroup_name</key>
				<string>%INELIGIBLE_GROUP_NAME%</string>
				<key>computergroup_template</key>
				<string>%INELIGIBLE_GROUP_TEMPLATE%</string>
				<key>replace_group</key>
				<string>True</string>
			</dict>
			<key>Processor</key>
			<string>com.github.grahampugh.jamf-upload.processors/JamfComputerGroupUploader</string>
		</dict>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>icon</key>
				<string>%SELFSERVICE_ICON%</string>
				<key>policy_name</key>
				<string>%POLICY_NAME%</string>
				<key>policy_template</key>
				<string>%POLICY_TEMPLATE%</string>
				<key>replace_policy</key>
				<string>True</string>
			</dict>
			<key>Processor</key>
			<string>com.github.grahampugh.jamf-upload.processors/JamfPolicyUploader</string>
		</dict>
	</array>
</dict>
</plist>
