<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Description</key>
	<string>Uploads the pkg to the JSS, and creates a Self-Service Policy available to members of a Testing group.</string>
	<key>Identifier</key>
	<string>com.github.eth-its-recipes.jamf.SPSSStatistics27-Floating</string>
	<key>Input</key>
	<dict>
		<key>EXTENSION_ATTRIBUTE_NAME</key>
		<string>SPSSStatistics %MAJOR_VERSION% License</string>
		<key>EXTENSION_ATTRIBUTE_SCRIPT</key>
		<string>SPSSStatistics-EA.sh</string>
		<key>EXTENSION_ATTRIBUTE_VALUE</key>
		<string>%LICENSE%</string>
		<key>FLOATING_LICENSE_URL</key>
		<string>REPLACE-ME</string>
		<key>INSTALLED_GROUP_NAME</key>
		<string>SPSS Statistics %MAJOR_VERSION% %LICENSE% installed</string>
		<key>INSTALLED_GROUP_TEMPLATE</key>
		<string>SmartGroup-installed.xml</string>
		<key>INSTALL_BUTTON_TEXT</key>
		<string>Install %version%</string>
		<key>LICENSE</key>
		<string>Floating</string>
		<key>LICENSE_INSTALLED_GROUP_NAME</key>
		<string>SPSS Statistics %MAJOR_VERSION% %LICENSE% License activated</string>
		<key>LICENSE_INSTALLED_GROUP_TEMPLATE</key>
		<string>SmartGroup-installed-for-license-EA.xml</string>
		<key>LICENSE_SET_INSTALL_BUTTON_TEXT</key>
		<string>Activate</string>
		<key>LICENSE_SET_MESSAGE_FINISH</key>
		<string>SPSS Statistics %MAJOR_VERSION% %LICENSE% License activated</string>
		<key>LICENSE_SET_POLICY_NAME</key>
		<string>Activate SPSS Statistics %MAJOR_VERSION% %LICENSE% License</string>
		<key>LICENSE_SET_POLICY_TEMPLATE</key>
		<string>Policy-prod-selfservice-install-license.xml</string>
		<key>LICENSE_SET_REINSTALL_BUTTON_TEXT</key>
		<string>Activate</string>
		<key>LICENSE_SET_SELFSERVICE_DESCRIPTION</key>
		<string>Activates the SPSS Statistics %MAJOR_VERSION% %LICENSE% License</string>
		<key>LICENSE_SET_SELFSERVICE_DISPLAY_NAME</key>
		<string>Activate SPSS Statistics %MAJOR_VERSION% %LICENSE% License</string>
		<key>LIST_LANGUAGE</key>
		<string>ML</string>
		<key>LIST_NAME</key>
		<string>IBM SPSS</string>
		<key>MAJOR_VERSION</key>
		<string>27</string>
		<key>MESSAGE_FINISH</key>
		<string>SPSS Statistics %MAJOR_VERSION% %LICENSE% License is now activated</string>
		<key>NAME</key>
		<string>SPSS Statistics</string>
		<key>PKG_CATEGORY</key>
		<string>Science &amp; Math</string>
		<key>POLICY_CATEGORY</key>
		<string>Untested</string>
		<key>POLICY_NAME</key>
		<string>SPSS Statistics %MAJOR_VERSION% %LICENSE% (Testing)</string>
		<key>POLICY_RUN_COMMAND</key>
		<string>jamf policy -event '%TRIGGER_NAME%'</string>
		<key>POLICY_TEMPLATE</key>
		<string>Policy-untested-selfservice.xml</string>
		<key>REINSTALL_BUTTON_TEXT</key>
		<string>Install %version%</string>
		<key>SCRIPT_NAME</key>
		<string>SPSSStatistics-floating-license-activation.sh</string>
		<key>SCRIPT_PATH</key>
		<string>SPSSStatistics-floating-license-activation.sh</string>
		<key>SCRIPT_PRIORITY</key>
		<string>After</string>
		<key>SELFSERVICE_DESCRIPTION</key>
		<string>An integrated interface for running descriptive statistics, regression, advanced statistics and more. SPSS Statistics can create publication ready charts, tables, and decision trees in one tool. Specialized extensions allow the SPSS Statistics syntax to be enhanced with R and Python through specialized extensions.
Version: %version%
Category: %PKG_CATEGORY%
</string>
		<key>SELFSERVICE_DISPLAY_NAME</key>
		<string>SPSS Statistics %MAJOR_VERSION% %LICENSE% (Testing)</string>
		<key>SELFSERVICE_ICON</key>
		<string>%NAME%.png</string>
		<key>TESTING_GROUP_NAME</key>
		<string>Testing</string>
		<key>TESTING_GROUP_TEMPLATE</key>
		<string>StaticGroup-testing.xml</string>
		<key>TEST_USERS_GROUP_NAME</key>
		<string>%NAME% %MAJOR_VERSION% %LICENSE% test users</string>
		<key>TEST_USERS_GROUP_TEMPLATE</key>
		<string>SmartGroup-test-users.xml</string>
		<key>TEST_VERSION_INSTALLED_GROUP_NAME</key>
		<string>%NAME% %MAJOR_VERSION% %LICENSE% test version installed</string>
		<key>TEST_VERSION_INSTALLED_GROUP_TEMPLATE</key>
		<string>SmartGroup-test-version-installed.xml</string>
		<key>TRIGGER_NAME</key>
		<string>Activate-SPSS-%MAJOR_VERSION%-%LICENSE%-License</string>
		<key>TRIGGER_POLICY_CATEGORY</key>
		<string>Triggered Installers</string>
		<key>TRIGGER_POLICY_NAME</key>
		<string>Trigger Activate SPSS Statistics %MAJOR_VERSION% %LICENSE% License</string>
		<key>TRIGGER_POLICY_RUN_COMMAND</key>
		<string>echo 'Installation of %POLICY_NAME% complete'</string>
		<key>TRIGGER_POLICY_TEMPLATE</key>
		<string>Policy-script-triggeronly.xml</string>
		<key>UPDATE_PREDICATE</key>
		<string>pkg_uploaded == False</string>
		<key>USERS_GROUP_NAME</key>
		<string>%NAME% %MAJOR_VERSION% %LICENSE% users</string>
		<key>USERS_GROUP_TEMPLATE</key>
		<string>SmartGroup-users.xml</string>
	</dict>
	<key>MinimumVersion</key>
	<string>2.0.0</string>
	<key>ParentRecipe</key>
	<string>ch.ethz.id.pkg.SPSSStatistics27</string>
	<key>Process</key>
	<array>
		<dict>
			<key>Processor</key>
			<string>com.github.grahampugh.recipes.commonprocessors/VersionRegexGenerator</string>
		</dict>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>category_name</key>
				<string>%PKG_CATEGORY%</string>
			</dict>
			<key>Processor</key>
			<string>com.github.grahampugh.jamf-upload.processors/JamfCategoryUploader</string>
		</dict>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>pkg_category</key>
				<string>%PKG_CATEGORY%</string>
			</dict>
			<key>Processor</key>
			<string>com.github.grahampugh.jamf-upload.processors/JamfPackageUploader</string>
		</dict>
		<dict>
			<key>Processor</key>
			<string>com.github.grahampugh.recipes.commonprocessors/WritePkgResultToJson</string>
		</dict>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>predicate</key>
				<string>%UPDATE_PREDICATE%</string>
			</dict>
			<key>Processor</key>
			<string>StopProcessingIf</string>
		</dict>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>category_name</key>
				<string>%POLICY_CATEGORY%</string>
			</dict>
			<key>Processor</key>
			<string>com.github.grahampugh.jamf-upload.processors/JamfCategoryUploader</string>
		</dict>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>category_name</key>
				<string>%TRIGGER_POLICY_CATEGORY%</string>
			</dict>
			<key>Processor</key>
			<string>com.github.grahampugh.jamf-upload.processors/JamfCategoryUploader</string>
		</dict>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>replace_script</key>
				<true/>
				<key>script_category</key>
				<string>%POLICY_CATEGORY%</string>
				<key>script_name</key>
				<string>%SCRIPT_NAME%</string>
				<key>script_path</key>
				<string>%SCRIPT_PATH%</string>
				<key>script_priority</key>
				<string>%SCRIPT_PRIORITY%</string>
			</dict>
			<key>Processor</key>
			<string>com.github.grahampugh.jamf-upload.processors/JamfScriptUploader</string>
		</dict>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>ea_name</key>
				<string>%EXTENSION_ATTRIBUTE_NAME%</string>
				<key>ea_script_path</key>
				<string>%EXTENSION_ATTRIBUTE_SCRIPT%</string>
				<key>replace_ea</key>
				<string>True</string>
			</dict>
			<key>Processor</key>
			<string>com.github.grahampugh.jamf-upload.processors/JamfExtensionAttributeUploader</string>
		</dict>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>computergroup_name</key>
				<string>%TESTING_GROUP_NAME%</string>
				<key>computergroup_template</key>
				<string>%TESTING_GROUP_TEMPLATE%</string>
				<key>replace_group</key>
				<string>False</string>
			</dict>
			<key>Processor</key>
			<string>com.github.grahampugh.jamf-upload.processors/JamfComputerGroupUploader</string>
		</dict>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>computergroup_name</key>
				<string>%TEST_USERS_GROUP_NAME%</string>
				<key>computergroup_template</key>
				<string>%TEST_USERS_GROUP_TEMPLATE%</string>
				<key>replace_group</key>
				<string>False</string>
			</dict>
			<key>Processor</key>
			<string>com.github.grahampugh.jamf-upload.processors/JamfComputerGroupUploader</string>
		</dict>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>computergroup_name</key>
				<string>%TEST_VERSION_INSTALLED_GROUP_NAME%</string>
				<key>computergroup_template</key>
				<string>%TEST_VERSION_INSTALLED_GROUP_TEMPLATE%</string>
				<key>replace_group</key>
				<string>True</string>
			</dict>
			<key>Processor</key>
			<string>com.github.grahampugh.jamf-upload.processors/JamfComputerGroupUploader</string>
		</dict>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>computergroup_name</key>
				<string>%USERS_GROUP_NAME%</string>
				<key>computergroup_template</key>
				<string>%USERS_GROUP_TEMPLATE%</string>
				<key>replace_group</key>
				<string>False</string>
			</dict>
			<key>Processor</key>
			<string>com.github.grahampugh.jamf-upload.processors/JamfComputerGroupUploader</string>
		</dict>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>computergroup_name</key>
				<string>%INSTALLED_GROUP_NAME%</string>
				<key>computergroup_template</key>
				<string>%INSTALLED_GROUP_TEMPLATE%</string>
				<key>replace_group</key>
				<string>True</string>
			</dict>
			<key>Processor</key>
			<string>com.github.grahampugh.jamf-upload.processors/JamfComputerGroupUploader</string>
		</dict>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>computergroup_name</key>
				<string>%LICENSE_INSTALLED_GROUP_NAME%</string>
				<key>computergroup_template</key>
				<string>%LICENSE_INSTALLED_GROUP_TEMPLATE%</string>
				<key>replace_group</key>
				<string>True</string>
			</dict>
			<key>Processor</key>
			<string>com.github.grahampugh.jamf-upload.processors/JamfComputerGroupUploader</string>
		</dict>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>icon</key>
				<string>%SELFSERVICE_ICON%</string>
				<key>policy_name</key>
				<string>%POLICY_NAME%</string>
				<key>policy_template</key>
				<string>%POLICY_TEMPLATE%</string>
				<key>replace_policy</key>
				<string>True</string>
			</dict>
			<key>Comment</key>
			<string>Untested Self Service policy</string>
			<key>Processor</key>
			<string>com.github.grahampugh.jamf-upload.processors/JamfPolicyUploader</string>
		</dict>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>policy_name</key>
				<string>%TRIGGER_POLICY_NAME%</string>
				<key>policy_template</key>
				<string>%TRIGGER_POLICY_TEMPLATE%</string>
				<key>replace_policy</key>
				<string>True</string>
			</dict>
			<key>Comment</key>
			<string>Trigger policy for activating the license</string>
			<key>Processor</key>
			<string>com.github.grahampugh.jamf-upload.processors/JamfPolicyUploader</string>
		</dict>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>policy_name</key>
				<string>%LICENSE_SET_POLICY_NAME%</string>
				<key>policy_template</key>
				<string>%LICENSE_SET_POLICY_TEMPLATE%</string>
				<key>replace_policy</key>
				<string>True</string>
			</dict>
			<key>Comment</key>
			<string>Self Service policy for activating the license</string>
			<key>Processor</key>
			<string>com.github.grahampugh.jamf-upload.processors/JamfPolicyUploader</string>
		</dict>
		<dict>
			<key>Processor</key>
			<string>com.github.grahampugh.recipes.postprocessors/LastRecipeRunResult</string>
		</dict>
	</array>
</dict>
</plist>
