<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Comment</key>
	<string>This recipe is a template recipe for auto-uninstall policies which remove an app. It can be overridden directly if the NAME, SELF_SERVICE_DESCRIPTION, SELF_SERVICE_ICON and SCRIPT_PATH keys are overridden. 
If using a template script, supply the SCRIPT_NAME key to give the script a unique name in Jamf. 
For Application-uninstall.sh, provide the PKG_ID key in the override. This allows the app to be closed and the package receipt to be removed. You will also need to provide JSS_INVENTORY_NAME if this does not match NAME.
If the policy name does not match the NAME key, e.g. due to language or license being added to the policy name, SELF_SERVICE_DISPLAY_NAME and smart group name values may also need to be overridden.
Do not add things like language or license to the NAME key.
</string>
	<key>Description</key>
	<string>Creates a Self Service Policy and Smart Group. Requires the uninstall recipe to have already been run.</string>
	<key>Identifier</key>
	<string>com.github.eth-its-recipes.jamf.template-script-autouninstall</string>
	<key>Input</key>
	<dict>
		<key>AUTOUNINSTALL_GROUP_NAME</key>
		<string>%NAME% auto-uninstall</string>
		<key>AUTOUNINSTALL_GROUP_TEMPLATE</key>
		<string>SmartGroup-autouninstall.xml</string>
		<key>AUTOUNINSTALL_POLICY_CATEGORY</key>
		<string>Auto-uninstallers</string>
		<key>AUTOUNINSTALL_POLICY_NAME</key>
		<string>Auto-uninstall %NAME%</string>
		<key>AUTOUNINSTALL_POLICY_TEMPLATE</key>
		<string>Policy-uninstall-autouninstall.xml</string>
		<key>INSTALLED_FOR_AUTOUNINSTALL_GROUP_NAME</key>
		<string>%NAME% can be auto-uninstalled</string>
		<key>INSTALLED_FOR_AUTOUNINSTALL_GROUP_TEMPLATE</key>
		<string>SmartGroup-installed-for-autouninstall.xml</string>
		<key>JSS_INVENTORY_NAME</key>
		<string>%NAME%.app</string>
		<key>UNINSTALL_TRIGGER_NAME</key>
		<string>%NAME%-uninstall</string>
		<key>USERS_GROUP_NAME</key>
		<string>%NAME% users</string>
	</dict>
	<key>MinimumVersion</key>
	<string>2.0.0</string>
	<key>Process</key>
	<array>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>category_name</key>
				<string>%AUTOUNINSTALL_POLICY_CATEGORY%</string>
			</dict>
			<key>Processor</key>
			<string>com.github.grahampugh.jamf-upload.processors/JamfCategoryUploader</string>
		</dict>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>computergroup_name</key>
				<string>%INSTALLED_FOR_AUTOUNINSTALL_GROUP_NAME%</string>
				<key>computergroup_template</key>
				<string>%INSTALLED_FOR_AUTOUNINSTALL_GROUP_TEMPLATE%</string>
				<key>replace_group</key>
				<true/>
			</dict>
			<key>Processor</key>
			<string>com.github.grahampugh.jamf-upload.processors/JamfComputerGroupUploader</string>
		</dict>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>computergroup_name</key>
				<string>%AUTOUNINSTALL_GROUP_NAME%</string>
				<key>computergroup_template</key>
				<string>%AUTOUNINSTALL_GROUP_TEMPLATE%</string>
				<key>replace_group</key>
				<false/>
			</dict>
			<key>Processor</key>
			<string>com.github.grahampugh.jamf-upload.processors/JamfComputerGroupUploader</string>
		</dict>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>policy_name</key>
				<string>%AUTOUNINSTALL_POLICY_NAME%</string>
				<key>policy_template</key>
				<string>%AUTOUNINSTALL_POLICY_TEMPLATE%</string>
				<key>replace_policy</key>
				<true/>
			</dict>
			<key>Processor</key>
			<string>com.github.grahampugh.jamf-upload.processors/JamfPolicyUploader</string>
		</dict>
	</array>
</dict>
</plist>
