<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Description</key>
	<string>Uploads a script to the Jamf Pro Server and creates a Self Service Policy and Smart Group.</string>
	<key>Identifier</key>
	<string>com.github.eth-its-recipes.jamf.AdoptOpenJDK8-uninstall</string>
	<key>Input</key>
	<dict>
		<key>EXTENSION_ATTRIBUTE_NAME</key>
		<string>AdoptOpenJDK8Version</string>
		<key>EXTENSION_ATTRIBUTE_SEARCH_TYPE</key>
		<string>does not match regex</string>
		<key>EXTENSION_ATTRIBUTE_SEARCH_VALUE</key>
		<string>^None$</string>
		<key>INSTALLED_GROUP_TEMPLATE</key>
		<string>SmartGroup-installed-EA.xml</string>
		<key>NAME</key>
		<string>AdoptOpenJDK 8</string>
		<key>PARAMETER4_LABEL</key>
		<string>JDK major version</string>
		<key>PARAMETER4_VALUE</key>
		<string>8</string>
		<key>PKG_ID</key>
		<string>com.AdoptOpenJDK-8.jdk</string>
		<key>SCRIPT_NAME</key>
		<string>AdoptOpenJDK-uninstall.sh</string>
		<key>SCRIPT_PATH</key>
		<string>AdoptOpenJDK-uninstall.sh</string>
		<key>SELFSERVICE_ICON</key>
		<string>AdoptOpenJDK.png</string>
	</dict>
	<key>MinimumVersion</key>
	<string>2.0.0</string>
	<key>ParentRecipe</key>
	<string>com.github.eth-its-recipes.jamf.template-script-parameter4-uninstall</string>
</dict>
</plist>
