<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Description</key>
	<string>Uploads a script to the Jamf Pro Server and creates a Self Service Policy and Smart Group.</string>
	<key>Identifier</key>
	<string>com.github.eth-its.recipes.jamf.CiscoAnyConnect-uninstall</string>
	<key>Input</key>
	<dict>
		<key>AUTOINSTALL_GROUP_NAME</key>
		<string>%NAME% auto-install</string>
		<key>AUTOINSTALL_GROUP_TEMPLATE</key>
		<string>SmartGroup-auto-install.xml</string>
		<key>INSTALLED_GROUP_NAME</key>
		<string>%NAME% installed</string>
		<key>INSTALLED_GROUP_TEMPLATE</key>
		<string>SmartGroup-installed.xml</string>
		<key>INSTALL_ALL_GROUP_NAME</key>
		<string>Software Gets Auto-installed</string>
		<key>INSTALL_ALL_GROUP_TEMPLATE</key>
		<string>SmartGroup-Software-Gets-Auto-installed.xml</string>
		<key>INSTALL_BUTTON_TEXT</key>
		<string>Uninstall</string>
		<key>NAME</key>
		<string>Cisco AnyConnect Secure Mobility Client</string>
		<key>POLICY_CATEGORY</key>
		<string>Uninstallers</string>
		<key>POLICY_NAME</key>
		<string>%NAME%</string>
		<key>POLICY_TEMPLATE</key>
		<string>Policy-uninstall-self-service.xml</string>
		<key>REINSTALL_BUTTON_TEXT</key>
		<string>Uninstall</string>
		<key>SCRIPT_NAME</key>
		<string>Cisco AnyConnect-uninstall.sh</string>
		<key>SCRIPT_PRIORITY</key>
		<string>After</string>
		<key>SELF_SERVICE_DESCRIPTION</key>
		<string>Uninstalls Cisco AnyConnect. Please note that with macOS Big Sur and above, an administrator account password must be provided via a prompt in order to remove the System Extension that comes with Cisco AnyConnect.</string>
		<key>SELF_SERVICE_DISPLAY_NAME</key>
		<string>Uninstall %NAME%</string>
		<key>SELF_SERVICE_ICON</key>
		<string>Cisco AnyConnect.png</string>
		<key>TESTING_GROUP_NAME</key>
		<string>Testing</string>
		<key>TESTING_GROUP_TEMPLATE</key>
		<string>StaticGroup-testing.xml</string>
		<key>UNINSTALL_POLICY_TEMPLATE</key>
		<string>Policy-uninstall-self-service.xml</string>
		<key>UNINSTALL_SELF_SERVICE_DESCRIPTION</key>
		<string>Uninstalls %NAME%</string>
		<key>UNINSTALL_SELF_SERVICE_DISPLAY_NAME</key>
		<string>Uninstall %NAME%</string>
		<key>UNINSTALL_SELF_SERVICE_INSTALL_BUTTON</key>
		<string>Uninstall</string>
		<key>UNINSTALL_SELF_SERVICE_REINSTALL_BUTTON</key>
		<string>Uninstall</string>
		<key>UNINSTALL_TRIGGERONLY_POLICY_TEMPLATE</key>
		<string>Policy-uninstall-triggeronly.xml</string>
		<key>UNINSTALL_TRIGGER_NAME</key>
		<string>%NAME%-uninstall</string>
		<key>USERS_GROUP_NAME</key>
		<string>%NAME% users</string>
		<key>USERS_GROUP_TEMPLATE</key>
		<string>SmartGroup-users.xml</string>
	</dict>
	<key>MinimumVersion</key>
	<string>2.0.0</string>
	<key>Process</key>
	<array>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>category_name</key>
				<string>%POLICY_CATEGORY%</string>
			</dict>
			<key>Processor</key>
			<string>com.github.grahampugh.jamf-upload.processors/JamfCategoryUploader</string>
		</dict>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>replace_script</key>
				<string>True</string>
				<key>script_category</key>
				<string>%POLICY_CATEGORY%</string>
				<key>script_path</key>
				<string>%SCRIPT_NAME%</string>
				<key>script_priority</key>
				<string>%SCRIPT_PRIORITY%</string>
			</dict>
			<key>Processor</key>
			<string>com.github.grahampugh.jamf-upload.processors/JamfScriptUploader</string>
		</dict>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>computergroup_name</key>
				<string>%TESTING_GROUP_NAME%</string>
				<key>computergroup_template</key>
				<string>%TESTING_GROUP_TEMPLATE%</string>
				<key>replace_group</key>
				<string>False</string>
			</dict>
			<key>Processor</key>
			<string>com.github.grahampugh.jamf-upload.processors/JamfComputerGroupUploader</string>
		</dict>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>computergroup_name</key>
				<string>%USERS_GROUP_NAME%</string>
				<key>computergroup_template</key>
				<string>%USERS_GROUP_TEMPLATE%</string>
				<key>replace_group</key>
				<string>False</string>
			</dict>
			<key>Processor</key>
			<string>com.github.grahampugh.jamf-upload.processors/JamfComputerGroupUploader</string>
		</dict>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>computergroup_name</key>
				<string>%INSTALL_ALL_GROUP_NAME%</string>
				<key>computergroup_template</key>
				<string>%INSTALL_ALL_GROUP_TEMPLATE%</string>
				<key>replace_group</key>
				<string>False</string>
			</dict>
			<key>Processor</key>
			<string>com.github.grahampugh.jamf-upload.processors/JamfComputerGroupUploader</string>
		</dict>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>computergroup_name</key>
				<string>%AUTOINSTALL_GROUP_NAME%</string>
				<key>computergroup_template</key>
				<string>%AUTOINSTALL_GROUP_TEMPLATE%</string>
				<key>replace_group</key>
				<string>False</string>
			</dict>
			<key>Processor</key>
			<string>com.github.grahampugh.jamf-upload.processors/JamfComputerGroupUploader</string>
		</dict>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>computergroup_name</key>
				<string>%INSTALLED_GROUP_NAME%</string>
				<key>computergroup_template</key>
				<string>%INSTALLED_GROUP_TEMPLATE%</string>
				<key>replace_group</key>
				<string>True</string>
			</dict>
			<key>Processor</key>
			<string>com.github.grahampugh.jamf-upload.processors/JamfComputerGroupUploader</string>
		</dict>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>icon</key>
				<string>%SELF_SERVICE_ICON%</string>
				<key>policy_name</key>
				<string>%POLICY_NAME%</string>
				<key>policy_template</key>
				<string>%POLICY_TEMPLATE%</string>
				<key>replace_policy</key>
				<string>True</string>
			</dict>
			<key>Processor</key>
			<string>com.github.grahampugh.jamf-upload.processors/JamfPolicyUploader</string>
		</dict>
	</array>
</dict>
</plist>
