<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Description</key>
	<string>Uploads a script to the Jamf Pro Server and creates a Self Service Policy and Smart Group.</string>
	<key>Identifier</key>
	<string>com.github.eth-its-recipes.jamf.EndNote20-uninstall</string>
	<key>Input</key>
	<dict>
		<key>AUTOINSTALL_GROUP_NAME</key>
		<string>%NAME% %MAJOR_VERSION% %LANGUAGE% auto-install</string>
		<key>INSTALLED_GROUP_NAME</key>
		<string>%NAME% %MAJOR_VERSION% %LANGUAGE% installed</string>
		<key>JSS_INVENTORY_NAME</key>
		<string>%NAME% %MAJOR_VERSION%.app</string>
		<key>LANGUAGE</key>
		<string>EN</string>
		<key>MAJOR_VERSION</key>
		<string>20</string>
		<key>NAME</key>
		<string>EndNote</string>
		<key>SCRIPT_NAME</key>
		<string>EndNote-uninstall.sh</string>
		<key>SCRIPT_PATH</key>
		<string>EndNote-uninstall.sh</string>
		<key>SELFSERVICE_ICON</key>
		<string>%NAME% %MAJOR_VERSION%.png</string>
		<key>TEST_USERS_GROUP_NAME</key>
		<string>%NAME% %MAJOR_VERSION% %LANGUAGE% test users</string>
		<key>TRIGGER_UNINSTALL_POLICY_NAME</key>
		<string>Trigger-uninstall %NAME% %MAJOR_VERSION% %LANGUAGE%</string>
		<key>UNINSTALL_POLICY_NAME</key>
		<string>Uninstall %NAME% %MAJOR_VERSION% %LANGUAGE%</string>
		<key>UNINSTALL_SELFSERVICE_DESCRIPTION</key>
		<string>Uninstalls %NAME% %MAJOR_VERSION% %LANGUAGE%</string>
		<key>UNINSTALL_SELFSERVICE_DISPLAY_NAME</key>
		<string>Uninstall %NAME% %MAJOR_VERSION% %LANGUAGE%</string>
		<key>UNINSTALL_TRIGGER_NAME</key>
		<string>%NAME% %MAJOR_VERSION%-uninstall</string>
		<key>USERS_GROUP_NAME</key>
		<string>%NAME% %MAJOR_VERSION% %LANGUAGE% users</string>
	</dict>
	<key>MinimumVersion</key>
	<string>2.0.0</string>
	<key>ParentRecipe</key>
	<string>com.github.eth-its-recipes.jamf.template-majorversion-script-uninstall</string>
</dict>
</plist>
