<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Description</key>
	<string>Uploads a script to the Jamf Pro Server and creates a Self Service Policy and Smart Group.</string>
	<key>Identifier</key>
	<string>com.github.eth-its-recipes.jamf.Fiji-uninstall</string>
	<key>Input</key>
	<dict>
		<key>AUTOINSTALL_GROUP_NAME</key>
		<string>%NAME% EN auto-install</string>
		<key>INSTALLED_GROUP_NAME</key>
		<string>%NAME% EN installed</string>
		<key>NAME</key>
		<string>Fiji</string>
		<key>SCRIPT_NAME</key>
		<string>Fiji-uninstall.sh</string>
		<key>SCRIPT_PATH</key>
		<string>Fiji-uninstall.sh</string>
		<key>SELFSERVICE_DISPLAY_NAME</key>
		<string>Uninstall %NAME% EN</string>
		<key>TEST_USERS_GROUP_NAME</key>
		<string>%NAME% EN test users</string>
		<key>TRIGGER_UNINSTALL_POLICY_NAME</key>
		<string>Trigger-uninstall %NAME% EN</string>
		<key>UNINSTALL_POLICY_NAME</key>
		<string>Uninstall %NAME% EN</string>
		<key>UNINSTALL_SELF_SERVICE_DISPLAY_NAME</key>
		<string>Uninstall %NAME% EN</string>
		<key>USERS_GROUP_NAME</key>
		<string>%NAME% EN users</string>
	</dict>
	<key>MinimumVersion</key>
	<string>2.0.0</string>
	<key>ParentRecipe</key>
	<string>com.github.eth-its-recipes.jamf.template-script-uninstall</string>
</dict>
</plist>
