<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Description</key>
	<string>Uploads a script to the Jamf Pro Server and creates a Self Service Policy and Smart Group.</string>
	<key>Identifier</key>
	<string>com.github.eth-its-recipes.jamf.SophosAntiVirus-uninstall</string>
	<key>Input</key>
	<dict>
		<key>EXTENSION_ATTRIBUTE_NAME</key>
		<string>SophosGroupPath</string>
		<key>EXTENSION_ATTRIBUTE_SCRIPT</key>
		<string>SophosAntiVirus-EA.sh</string>
		<key>EXTENSION_ATTRIBUTE_SEARCH_TYPE</key>
		<string>does not match regex</string>
		<key>EXTENSION_ATTRIBUTE_SEARCH_VALUE</key>
		<string>^$</string>
		<key>INSTALLED_GROUP_TEMPLATE</key>
		<string>SmartGroup-installed-EA.xml</string>
		<key>NAME</key>
		<string>Sophos Anti-Virus</string>
		<key>PARAMETER4_LABEL</key>
		<string>Tamper password</string>
		<key>PARAMETER4_VALUE</key>
		<string>None</string>
		<key>PKG_ID</key>
		<string>ch.ethz.id.pkg.SophosAntiVirus</string>
		<key>SCRIPT_NAME</key>
		<string>SophosAntiVirus-uninstall.sh</string>
		<key>SCRIPT_PATH</key>
		<string>SophosAntiVirus-uninstall.sh</string>
		<key>SELFSERVICE_ICON</key>
		<string>Sophos Anti-Virus.png</string>
	</dict>
	<key>MinimumVersion</key>
	<string>2.3</string>
	<key>ParentRecipe</key>
	<string>com.github.eth-its-recipes.jamf.template-script-EA-uninstall</string>
</dict>
</plist>
