<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Description</key>
	<string>Uploads a script to the Jamf Pro Server and creates a Self Service Policy and Smart Group.</string>
	<key>Identifier</key>
	<string>com.github.eth-its-recipes.jamf.SPSSStatistics27-uninstall</string>
	<key>Input</key>
	<dict>
		<key>MAJOR_VERSION</key>
		<string>27</string>
		<key>NAME</key>
		<string>SPSS Statistics</string>
		<key>POLICY_NAME</key>
		<string>Policy-uninstall-triggeronly-script-parameter4.xml</string>
		<key>SCRIPT_NAME</key>
		<string>SPSS Statistics-uninstall.sh</string>
		<key>SCRIPT_PATH</key>
		<string>SPSS Statistics-uninstall.sh</string>
	</dict>
	<key>MinimumVersion</key>
	<string>2.0.0</string>
	<key>ParentRecipe</key>
	<string>com.github.eth-its-recipes.jamf.template-majorversion-script-uninstall</string>
</dict>
</plist>
