<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Description</key>
	<string>Uploads a script to the Jamf Pro Server and creates a Self Service Policy and Smart Group.</string>
	<key>Identifier</key>
	<string>com.github.eth-its-recipes.jamf.SPSSStatistics27-Node-uninstall</string>
	<key>Input</key>
	<dict>
		<key>ADDITIONAL_EXCLUSION_GROUP_NAME</key>
		<string>SPSS Statistics %MAJOR_VERSION% Floating License activated</string>
		<key>AUTOINSTALL_GROUP_NAME</key>
		<string>%NAME% %MAJOR_VERSION% %LICENSE% auto-install</string>
		<key>INSTALLED_GROUP_NAME</key>
		<string>%NAME% %MAJOR_VERSION% %LICENSE% installed</string>
		<key>LICENSE</key>
		<string>Node</string>
		<key>MAJOR_VERSION</key>
		<string>27</string>
		<key>NAME</key>
		<string>SPSS Statistics</string>
		<key>SCRIPT_NAME</key>
		<string>SPSS Statistics-uninstall.sh</string>
		<key>SCRIPT_PATH</key>
		<string>SPSS Statistics-uninstall.sh</string>
		<key>TEST_USERS_GROUP_NAME</key>
		<string>%NAME% %MAJOR_VERSION% %LICENSE% test users</string>
		<key>TRIGGER_UNINSTALL_POLICY_NAME</key>
		<string>Trigger-uninstall %NAME% %MAJOR_VERSION% %LICENSE%</string>
		<key>UNINSTALL_POLICY_NAME</key>
		<string>Uninstall %NAME% %MAJOR_VERSION% %LICENSE%</string>
		<key>UNINSTALL_POLICY_TEMPLATE</key>
		<string>Policy-uninstall-selfservice-extra-exclusion.xml</string>
		<key>UNINSTALL_SELFSERVICE_DESCRIPTION</key>
		<string>Uninstalls %NAME% %MAJOR_VERSION% %LICENSE%</string>
		<key>UNINSTALL_SELFSERVICE_DISPLAY_NAME</key>
		<string>Uninstall %NAME% %MAJOR_VERSION% %LICENSE%</string>
		<key>UNINSTALL_TRIGGER_NAME</key>
		<string>%NAME% %MAJOR_VERSION% %LICENSE%-uninstall</string>
		<key>USERS_GROUP_NAME</key>
		<string>%NAME% %MAJOR_VERSION% %LICENSE% users</string>
	</dict>
	<key>MinimumVersion</key>
	<string>2.0.0</string>
	<key>ParentRecipe</key>
	<string>com.github.eth-its-recipes.jamf.template-majorversion-script-uninstall</string>
</dict>
</plist>
