Description: Uploads a script to the Jamf Pro Server and creates a Self Service Policy and Smart Group.
Identifier: com.github.eth-its-recipes.jamf.AdobeFlashPlayer-autouninstall
MinimumVersion: 2.0.0
ParentRecipe: com.github.eth-its-recipes.jamf.template-script-autouninstall

Input:
  NAME: Adobe Flash Player
  SCRIPT_PATH: AdobeFlashPlayer-uninstall.sh
  SCRIPT_NAME: AdobeFlashPlayer-uninstall.sh
  EXTENSION_ATTRIBUTE_NAME: AdobeFlashVersion
  INSTALLED_GROUP_TEMPLATE: SmartGroup-installed-EA.xml
