Description: Uploads a script to the Jamf Pro Server and creates a Self Service Policy and Smart Group.
Identifier: com.github.eth-its-recipes.jamf.AdoptOpenJDK8-uninstall
MinimumVersion: 2.0.0
ParentRecipe: com.github.eth-its-recipes.jamf.template-script-parameter4-uninstall

Input:
  NAME: AdoptOpenJDK 8
  SCRIPT_PATH: AdoptOpenJDK-uninstall.sh
  SCRIPT_NAME: AdoptOpenJDK-uninstall.sh
  PARAMETER4_LABEL: JDK major version
  PARAMETER4_VALUE: "8"
  PKG_ID: com.AdoptOpenJDK-8.jdk
  EXTENSION_ATTRIBUTE_NAME: AdoptOpenJDK8Version
  INSTALLED_GROUP_TEMPLATE: SmartGroup-installed-EA.xml
  SELFSERVICE_ICON: AdoptOpenJDK.png
