Description: Uploads a script to the Jamf Pro Server and creates a Self Service Policy and Smart Group.
Identifier: com.github.eth-its-recipes.jamf.CiscoAnyConnect-uninstall
MinimumVersion: 2.0.0
ParentRecipe: com.github.eth-its-recipes.jamf.template-script-uninstall

Input:
  NAME: Cisco AnyConnect Secure Mobility Client
  SCRIPT_PATH: Cisco AnyConnect-uninstall.sh
  SCRIPT_NAME: Cisco AnyConnect-uninstall.sh
  SELF_SERVICE_DESCRIPTION: Uninstalls Cisco AnyConnect. Please note that with macOS Big Sur and above, an administrator account password must be provided via a prompt in order to remove the System Extension that comes with Cisco AnyConnect.
  SELF_SERVICE_ICON: Cisco AnyConnect.png
