Description: Uploads a script to the Jamf Pro Server and creates a Self Service Policy and Smart Group.
Identifier: com.github.eth-its-recipes.jamf.SophosAntiVirus-autouninstall
MinimumVersion: 2.0.0
ParentRecipe: com.github.eth-its-recipes.jamf.template-script-autouninstall

Input:
  NAME: Sophos Anti-Virus
  SCRIPT_PATH: SophosAntiVirus-uninstall.sh
  SCRIPT_NAME: SophosAntiVirus-uninstall.sh
  PKG_ID: ch.ethz.id.pkg.SophosAntiVirus
  EXTENSION_ATTRIBUTE_NAME: SophosPrimaryServerURL
  INSTALLED_FOR_AUTOUNINSTALL_GROUP_TEMPLATE: SmartGroup-installed-for-autouninstall-EA.xml
