Description: Uploads a script to the Jamf Pro Server and creates a Self Service Policy and Smart Group.
Identifier: com.github.eth-its-recipes.jamf.SPSSStatistics27-Node-uninstall
MinimumVersion: 2.0.0
ParentRecipe: com.github.eth-its-recipes.jamf.template-majorversion-script-uninstall

Input:
  NAME: SPSS Statistics
  MAJOR_VERSION: "27"
  LICENSE: Node
  UNINSTALL_POLICY_NAME: "Uninstall %NAME% %MAJOR_VERSION% %LICENSE%"
  SCRIPT_PATH: SPSS Statistics-uninstall.sh
  SCRIPT_NAME: SPSS Statistics-uninstall.sh
  INSTALLED_GROUP_NAME: "%NAME% %MAJOR_VERSION% %LICENSE% installed"
  TEST_USERS_GROUP_NAME: "%NAME% %MAJOR_VERSION% %LICENSE% test users"
  TRIGGER_UNINSTALL_POLICY_NAME: "Trigger-uninstall %NAME% %MAJOR_VERSION% %LICENSE%"
  UNINSTALL_SELFSERVICE_DESCRIPTION: "Uninstalls %NAME% %MAJOR_VERSION% %LICENSE%"
  UNINSTALL_SELFSERVICE_DISPLAY_NAME: "Uninstall %NAME% %MAJOR_VERSION% %LICENSE%"
  UNINSTALL_TRIGGER_NAME: "%NAME% %MAJOR_VERSION% %LICENSE%-uninstall"
  USERS_GROUP_NAME: "%NAME% %MAJOR_VERSION% %LICENSE% users"
  AUTOINSTALL_GROUP_NAME: "%NAME% %MAJOR_VERSION% %LICENSE% auto-install"
